RuPingCen/mick_robot_chasiss/STM32_Code/User/SDIO_SD/SDIO_SD.c
/**********************************************************************************************           
  *          +-----------------------------------------------------------+
  *          |                     Pin assignment                        |
  *          +-----------------------------+---------------+-------------+
  *          |  STM32 SDIO Pins            |     SD        |    Pin      |
  *          +-----------------------------+---------------+-------------+
  *          |      SDIO D2                |   D2          |    1        |
  *          |      SDIO D3                |   D3          |    2        |
  *          |      SDIO CMD               |   CMD         |    3        |
  *          |                             |   VCC         |    4 (3.3 V)|
  *          |      SDIO CLK               |   CLK         |    5        |
  *          |                             |   GND         |    6 (0 V)  |
  *          |      SDIO D0                |   D0          |    7        |
  *          |      SDIO D1                |   D1          |    8        |  
  *          +-----------------------------+---------------+-------------+  
	*
	*         1、 //注：擦除后是0xff或0x00    startaddr必须是512的整数倍 
	*         2、//需要在主函数定义的变量：    SD_Error Status = SD_OK;//用于存储该底层函数返回的状态
	*																					 extern SD_CardInfo SDCardInfo;//当需要调用结构体SD_CardInfo 存放的SD卡的信息时定义
	*         3、//需要在中断函数中写入这段代码 
	*							void SDIO_IRQHandler(void) //在SDIO_ITConfig(）这个函数开启了sdio中断	， 数据传输结束时产生中断
	*							{
	*			
	*								SD_ProcessIRQSrc();// Process All SDIO Interrupt Sources 
	*							}
	*         4、若需要改变DMA中断的优先级   可以在  SD_Init() 函数中修改
	*
	*         （对于这个底层  并没有完全理解 目前只理解了初始化部分  对于使用ＤＭＡ传送数据那块　　　还没有很好的理解）
	*
	*  SD_Error SD_Init(void)//初始化SD卡，使卡处于就绪状态(准备传输数据) 
	*  SD_Error SD_Erase(uint32_t startaddr, uint32_t endaddr);// SD_Error: 成功后会返回   SD_OK          
  *
//---------------------------------------------------------------------//
//---------------------单块空间的读数据------------------------------------//	
 
	    SD_Error SD_ReadBlock(uint8_t *readbuff, uint32_t ReadAddr, uint16_t BlockSize)//startaddr必须是512的整数倍  
			SD_WaitReadOperation();  //等待DMA传输结束
			while(SD_GetStatus() != SD_TRANSFER_OK);// 查询接收是否结束    完成后会返回  SD_TRANSFER_OK
 
//---------------------------------------------------------------------//
//---------------------单块空间的写数据------------------------------------//
	    SD_WriteBlock(uint8_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize);  //startaddr必须是512的整数倍  
			SD_WaitWriteOperation(); //等待DMA传输结束
			while(SD_GetStatus() != SD_TRANSFER_OK); // 查询传输是否结束    完成后会返回  SD_TRANSFER_OK	
//------------------------------------------------------------------------//
//---------------------多块空间的读数据------------------------------------// 			
		 SD_ReadMultiBlocks(uint8_t *readbuff, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)
		 SD_WaitReadOperation();
     while(SD_GetStatus() != SD_TRANSFER_OK);	
//------------------------------------------------------------------------//
//---------------------多块空间的写数据------------------------------------// 
		
	   SD_WriteMultiBlocks(uint8_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks)	
     SD_WaitWriteOperation();//等待DMA传输结束
     while(SD_GetStatus() != SD_TRANSFER_OK);// 查询传输是否结束    完成后会返回  SD_TRANSFER_OK	

***********************************************************************************************/ 


#include "SDIO_SD.h"
#include "stm32f10x_sdio.h"  	
#include "bsp_uart.h"

SD_CardInfo SDCardInfo;	  //用于存储卡的信息，DSR的一部分  在初始化函数调用后SD卡的信息会自动存储在这个结构体中









/* Private macro -------------------------------------------------------------*/
/** 
  * @brief  SDIO Static flags, TimeOut, FIFO Address  
  */
#define NULL 0
#define SDIO_STATIC_FLAGS               ((uint32_t)0x000005FF)
#define SDIO_CMD0TIMEOUT                ((uint32_t)0x00010000)

/** 
  * @brief  Mask for errors Card Status R1 (OCR Register) 
  */
#define SD_OCR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000)
#define SD_OCR_ADDR_MISALIGNED          ((uint32_t)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR            ((uint32_t)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR            ((uint32_t)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM          ((uint32_t)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000)
#define SD_OCR_COM_CRC_FAILED           ((uint32_t)0x00800000)
#define SD_OCR_ILLEGAL_CMD              ((uint32_t)0x00400000)
#define SD_OCR_CARD_ECC_FAILED          ((uint32_t)0x00200000)
#define SD_OCR_CC_ERROR                 ((uint32_t)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000)
#define SD_OCR_CID_CSD_OVERWRIETE       ((uint32_t)0x00010000)
#define SD_OCR_WP_ERASE_SKIP            ((uint32_t)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED        ((uint32_t)0x00004000)
#define SD_OCR_ERASE_RESET              ((uint32_t)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR            ((uint32_t)0x00000008)
#define SD_OCR_ERRORBITS                ((uint32_t)0xFDFFE008)

/** 
  * @brief  Masks for R6 Response 
  */
#define SD_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000)
#define SD_R6_ILLEGAL_CMD               ((uint32_t)0x00004000)
#define SD_R6_COM_CRC_FAILED            ((uint32_t)0x00008000)

#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x80100000)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AA)//

#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                      ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000)

#define SD_DATATIMEOUT                  ((uint32_t)0xFFFFFFFF)
#define SD_0TO7BITS                     ((uint32_t)0x000000FF)
#define SD_8TO15BITS                    ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                   ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                   ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFF)

