RuPingCen/mick_robot_chasiss/STM32_Code/User/SDIO_SD/SDIO_SD.c
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }

  /*!< Send CMD55 APP_CMD with argument as card's RCA */
  SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16; 
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }
  /*设置数据接收寄存器*/
  SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = 8;  //8byte,64位
  SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_8b  ;  //块大小8byte 
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  SDIO_DataConfig(&SDIO_DataInitStructure);			 

  /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
  SDIO_CmdInitStructure.SDIO_Argument = 0x0;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_SEND_SCR;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;  //r1
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(SD_CMD_SD_APP_SEND_SCR);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }			   
   
  /*等待接收数据 */
  /*不是这些情况就循环*/																						  
 /*上溢出错	  //数据crc失败		//数据超时	  //已接收数据块，crc检测成功	//没有在所有数据线上检测到起始信号*/
 while (!(SDIO->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND| SDIO_FLAG_STBITERR)))
   {	   		
   if (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)	//接收到的数据是否可用
	{  	
     	 	*(tempscr + index) = SDIO_ReadData();  
			   index++;	

		/*   //add。这段在官方源码没有加判断            */		     
		  	if(index > 1 ) 
				break;
    }
	
  }

  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    errorstatus = SD_DATA_TIMEOUT;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    errorstatus = SD_DATA_CRC_FAIL;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
    errorstatus = SD_RX_OVERRUN;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    errorstatus = SD_START_BIT_ERR;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS) << 24) | ((tempscr[0] & SD_8TO15BITS) << 8) | ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

  *(pscr) = ((tempscr[1] & SD_0TO7BITS) << 24) | ((tempscr[1] & SD_8TO15BITS) << 8) | ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);

  return(errorstatus);
}


/**
  * @brief  Converts the number of bytes in power of two and returns the power.
  * @param  NumberOfBytes: number of bytes.
  * @retval None
  */
uint8_t convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes)
{
  uint8_t count = 0;

  while (NumberOfBytes != 1)
  {
    NumberOfBytes >>= 1;
    count++;
  }
  return(count);
}




















/*************************************************************************
*  函数名称：Display_SD_Information
*  功能说明：通过串口打印SD卡的信息   若初始化不成功则不打印
*  参数说明：无
*             
*  函数返回：无
*  修改时间：2014-12-25
*  备    注：CRP   
*************************************************************************/
 void Display_SD_Information(void)
 {
	  UART_send_string(USART1," \r\n\n\tSD卡信息\n");//字符串函数
    UART_send_string(USART1," \r\n CardType is ： ");//字符串函数
	 
	  if(SDCardInfo.CardType == SDIO_STD_CAPACITY_SD_CARD_V1_1)
		{
        UART_send_string(USART1,"SDIO_STD_CAPACITY_SD_CARD_V1_1");//字符串函数
    }
		else if(SDCardInfo.CardType == SDIO_STD_CAPACITY_SD_CARD_V2_0)
		{ 
        UART_send_string(USART1,"SDIO_STD_CAPACITY_SD_CARD_V2_0");//字符串函数
    }
		else if(SDCardInfo.CardType == SDIO_HIGH_CAPACITY_SD_CARD)
		{ 
        UART_send_string(USART1,"SDIO_HIGH_CAPACITY_SD_CARD");//字符串函数
    }
		else if(SDCardInfo.CardType == SDIO_MULTIMEDIA_CARD)
		{ 
        UART_send_string(USART1,"SDIO_MULTIMEDIA_CARD");//字符串函数
    }
		else if(SDCardInfo.CardType == SDIO_SECURE_DIGITAL_IO_CARD)
		{ 
        UART_send_string(USART1,"SDIO_SECURE_DIGITAL_IO_CARD");//字符串函数
    }	
		else if(SDCardInfo.CardType == SDIO_HIGH_SPEED_MULTIMEDIA_CARD)
		{ 
        UART_send_string(USART1,"SDIO_HIGH_SPEED_MULTIMEDIA_CARD");//字符串函数
    }	
		else if(SDCardInfo.CardType == SDIO_SECURE_DIGITAL_IO_COMBO_CARD)
		{ 
        UART_send_string(USART1,"SDIO_SECURE_DIGITAL_IO_COMBO_CARD");//字符串函数
    }
		else if(SDCardInfo.CardType == SDIO_HIGH_CAPACITY_MMC_CARD)
		{ 
        UART_send_string(USART1,"SDIO_HIGH_CAPACITY_MMC_CARD");//字符串函数
    }
		else ;
		
		
	  UART_send_string(USART1," \r\n CardBlockSize is :  ");//字符串函数
	  UART_send_data(USART1,SDCardInfo.CardBlockSize);  // 0~4294967296	 
		
		UART_send_string(USART1," \r\n CardCapacity is ： ");//字符串函数
	  UART_send_data(USART1,SDCardInfo.CardCapacity );  // 0~4294967296
 
    UART_send_string(USART1," \r\n RCA is :  "); 
		UART_send_data(USART1,SDCardInfo.RCA);  // 0~4294967296	 	  
	  UART_send_string(USART1," \r\n ManufacturerID is : "); 
	  UART_send_data(USART1,SDCardInfo.SD_cid.ManufacturerID);  // 0~4294967296	 
		UART_send_string(USART1," \r\n\n"); 

}




//-------------------------------SD卡初始化相关函数---------------------------------------------------//
//----------------------------------------------------------------------------------------------------//


/*
 * 函数名：SD_Init
 * 描述  ：初始化SD卡，使卡处于就绪状态(准备传输数据)
 * 输入  ：无
 * 输出  ：-SD_Error SD卡错误代码
 *         成功时则为 SD_OK
 * 调用  ：外部调用
 */
SD_Error SD_Init(void) 
{
	static char SD_timers=0;
  SD_Error errorstatus = SD_OK;/*重置SD_Error状态*/  
	if(SD_timers==0)
	{
      	SD_DeInit();//SDIO模块端口复位  ---可以不调用
	
