RuPingCen/mick_robot_chasiss/STM32_Code/User/SDIO_SD/SDIO_SD.c
				NVIC_Configuration();/* 中断初始化 */
				GPIO_Configuration();/* SDIO 外设底层引脚初始化 */
				SDIO_DeInit(); /*对SDIO的所有寄存器进行复位*/ 
  }

 
	
  errorstatus = SD_PowerON(); /*上电并进行卡识别流程，确认卡的操作电压  */ 
  if (errorstatus != SD_OK)/*如果上电，识别不成功，返回“响应超时”错误 */
  {  
    return(errorstatus);	 /*!< CMD Response TimeOut (wait for CMDSENT flag) */
  }
	
	
  errorstatus = SD_InitializeCards();  /*卡识别成功，进行卡初始化    */
  if (errorstatus != SD_OK)	  //失败返回
  {   
    return(errorstatus); /*!< CMD Response TimeOut (wait for CMDSENT flag) */
  }

  /* 配置SDIO外设
   * 上电识别，卡初始化都完成后，进入数据传输模式，提高读写速度
   * 速度若超过24M要进入bypass模式 
   */
  
  /* SDIOCLK = HCLK, SDIO_CK = HCLK/(2 + SDIO_TRANSFER_CLK_DIV) */  
  SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV;
  SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;/*上升沿采集数据 */	
  SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;/* 时钟频率若超过24M,要开启此模式 */ 		
  SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;/* 若开启此功能，在总线空闲时关闭sd_clk时钟 */ 	
  SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;/* 暂时配置成1bit模式 */	
  SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;/* 硬件流，若开启，在FIFO不能进行发送和接收数据时，数据传输暂停 */ 	
  SDIO_Init(&SDIO_InitStructure);
  
  if (errorstatus == SD_OK)
  {   
     errorstatus = SD_GetCardInfo(&SDCardInfo); /* 获取SD卡的具体信息  存放在该底层的宏变量--SDCardInfo结构体中*/	
  }
  if (errorstatus == SD_OK)
  {    
    errorstatus = SD_SelectDeselect((uint32_t) (SDCardInfo.RCA << 16));	/* 通过cmd7  ,rca选择要操作的卡 */  
  }
	
  if (errorstatus == SD_OK)
  {			
    errorstatus = SD_EnableWideBusOperation(SDIO_BusWide_4b);/* 最后为了提高读写，开启4bits模式 */
  } 
	if(SD_timers==0)
	{
      	Display_SD_Information();
		    SD_timers=1;
  }	
  
  return(errorstatus);
}

/*
 * 函数名：SD_PowerON
 * 描述  ：确保SD卡的工作电压和配置控制时钟
 * 输入  ：无
 * 输出  ：-SD_Error SD卡错误代码
 *         成功时则为 SD_OK
 * 调用  ：在 SD_Init() 调用
 */
SD_Error SD_PowerON(void)
{
  SD_Error errorstatus = SD_OK;
  uint32_t response = 0, count = 0, validvoltage = 0;
  uint32_t SDType = SD_STD_CAPACITY;
	
/********************************************************************************************************/
  /* 上电初始化 
   * 配置SDIO的外设
   * SDIOCLK = HCLK, SDIO_CK = HCLK/(2 + SDIO_INIT_CLK_DIV)   
   * 初始化时的时钟不能大于400KHz
   */
/* HCLK = 72MHz, SDIOCLK = 72MHz, SDIO_CK = HCLK/(178 + 2) = 400 KHz */
  SDIO_InitStructure.SDIO_ClockDiv = SDIO_INIT_CLK_DIV;	
  SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;		
  SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;/* 不使用bypass模式，直接用HCLK进行分频得到SDIO_CK 超过24M时才使用bypass模式*/	
  SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;/* 空闲时不关闭时钟电源 */  	
  SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;/* 初始化的时候暂时先把数据线配置成1根 */	
  SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;/* 使能硬件流控制 */
  SDIO_Init(&SDIO_InitStructure);
  SDIO_SetPowerState(SDIO_PowerState_ON); /* 开启SDIO外设的电源 */  
  SDIO_ClockCmd(ENABLE);  /* 使能 SDIO 时钟 */
	
/********************************************************************************************************/   
  /* 下面发送一系列命令,开始卡识别流程
   * CMD0: GO_IDLE_STATE(复位所以SD卡进入空闲状态) 
   * 没有相应 
	 */
  SDIO_CmdInitStructure.SDIO_Argument = 0x0;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_GO_IDLE_STATE;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_No;/* 没有响应 */	
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;/* 关闭等待中断 */	
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable; /* 则CPSM在开始发送命令之前等待数据传输结束 */
  SDIO_SendCommand(&SDIO_CmdInitStructure);	  		
	
	
  errorstatus = CmdError();/* 检测是否成功发送cmd0 */
  if (errorstatus != SD_OK)//如果超时会返回	SDIO_CMD0TIMEOUT  反之返回 SD_OK
  {     
    return(errorstatus);
  }
	
/********************************************************************************************************/
  /* Send CMD8 to verify SD card interface operating condition
	 *          
   * Argument: - [31:12]: Reserved (shall be set to '0')
   *           - [11:8] : Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
   *           - [7:0]  : Check Pattern (recommended 0xAA) 
	 */ 
  SDIO_CmdInitStructure.SDIO_Argument = SD_CHECK_PATTERN;/* 接收到命令sd会返回这个参数 */
  SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SEND_IF_COND;//CMD8   CMD Response: R7 
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;	 
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;			 				
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp7Error();  /*检查是否接收到命令*/
	
	
  if (errorstatus == SD_OK)	  	/* 有响应则card遵循sd协议2.0版本 */
  {	
   // printf( " \r\n SD Card 2.0  \r\n " );				
    CardType = SDIO_STD_CAPACITY_SD_CARD_V2_0;/* SD Card 2.0 ，先把它定义会sdsc类型的卡 */				
    SDType = SD_HIGH_CAPACITY;	/* 这个变量用作ACMD41的参数，用来询问是sdsc卡还是sdhc卡 */
  }
  else	/* 无响应，说明是1.x的或mmc的卡 */
  {
   	// printf( " \r\n SD Card 1.0  \r\n " );	  
    SDIO_CmdInitStructure.SDIO_Argument = 0x00; /* 发命令 CMD55 */
    SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);
    errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
  }
	

  SDIO_CmdInitStructure.SDIO_Argument = 0x00;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;//发送cmd55，用于检测是sd卡还是mmc卡，或是不支持的卡
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);		
  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);	/* 是否响应，没响应的是mmc或不支持的卡 */
	
	
/********************************************************************************************************/
  /* If errorstatus is Command TimeOut, it is a MMC card 
   * If errorstatus is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch)
   * or SD card 1.x 
	 */
	
  if (errorstatus == SD_OK)	//响应了cmd55，是sd卡，可能为1.x,可能为2.0
  {
  	/*下面开始循环地发送sdio支持的电压范围，循环一定次数*/

    /* SD CARD
     * Send ACMD41 SD_APP_OP_COND with Argument 0x80100000 
		 */
    while ((!validvoltage) && (count < SD_MAX_VOLT_TRIAL))
    {	 
			/* 在发送ACMD命令前都要先向卡发送CMD55 
       * SEND CMD55 APP_CMD with RCA as 0 
			 */
      SDIO_CmdInitStructure.SDIO_Argument = 0x00;
      SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;	  
      SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
      SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
      SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
      SDIO_SendCommand(&SDIO_CmdInitStructure);

      errorstatus = CmdResp1Error(SD_CMD_APP_CMD);
			
